In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Users/sarthakshandilya/anaconda3/lib/python3.10/site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/sarthakshandilya/anaconda3/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /Users/sarthakshandilya/anaconda3/lib/python3.10/site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in /Users/sarthakshandilya/anaconda3/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /Users/sarthakshandilya/anaconda3/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd

In [4]:
pd.__version__

'1.5.3'

In [5]:
lst=[1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
import numpy as np
arr=np.array([1,2,3,4])
pd.Series(arr)

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
pd.Series(index=['Eshant','pranjal','jayesh','ashish'],data=[1,2,3,4])

Eshant     1
pranjal    2
jayesh     3
ashish     4
dtype: int64

In [9]:
steps={'day1':4000,'day2':3000,'day3':12000}
pd.Series(steps)

day1     4000
day2     3000
day3    12000
dtype: int64

In [10]:
pd.Series(5).repeat(3)

0    5
0    5
0    5
dtype: int64

In [11]:
pd.Series(5).repeat(3).reset_index(drop=True)

0    5
1    5
2    5
dtype: int64

In [14]:
s=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)
s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [15]:
s[4]

10

In [16]:
s[0]

10

In [18]:
s[3:-3]

3    10
dtype: int64

In [19]:
s[2:-2]

2    10
3    10
4    10
dtype: int64

In [20]:
sr=pd.Series([1,2,3,4,5,6,7])

In [22]:
sr.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

In [28]:
ab=pd.Series([1,-2,3,-4,5,-6,7])

In [29]:
ab.abs()

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [30]:
sr1=pd.Series([1,-2,3])

In [31]:
sr2=pd.Series([1,2,3])

In [36]:
sr3=pd.concat([sr1,sr2])

In [37]:
sr3

0    1
1   -2
2    3
0    1
1    2
2    3
dtype: int64

In [38]:
sr3.reset_index(drop=True)

0    1
1   -2
2    3
3    1
4    2
5    3
dtype: int64

In [39]:
sr1

0    1
1   -2
2    3
dtype: int64

In [40]:
type(sr1)

pandas.core.series.Series

In [41]:
type(sr1[0])

numpy.int64

In [42]:
sr1.astype('float')

0    1.0
1   -2.0
2    3.0
dtype: float64

In [44]:
s=pd.Series([1,2,30,4,5,6,7,8,9,20])

In [45]:
s.between(10,50)

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [46]:
ser=pd.Series(["Eshant Das","Data Science","Geeks for Geeks","Hello World","machine lerning"])

In [47]:
ser.str.upper()

0         ESHANT DAS
1       DATA SCIENCE
2    GEEKS FOR GEEKS
3        HELLO WORLD
4    MACHINE LERNING
dtype: object

In [49]:
ser.str.lower()

0         eshant das
1       data science
2    geeks for geeks
3        hello world
4    machine lerning
dtype: object

In [50]:
ser.str.len

In [60]:
for i in ser:
    print(i ,"" ,len(i))

Eshant Das  10
Data Science  12
Geeks for Geeks  15
Hello World  11
machine lerning  15

In [61]:
ser.to_list()

['Eshant Das',
 'Data Science',
 'Geeks for Geeks',
 'Hello World',
 'machine lerning']

In [2]:
lst=['geeks','for','geeks','is','a','portal','for','geeks']

In [3]:
lst

['geeks', 'for', 'geeks', 'is', 'a', 'portal', 'for', 'geeks']

In [5]:
import pandas as pd
pd.DataFrame(lst)

        0
0   geeks
1     for
2   geeks
3      is
4       a
5  portal
6     for
7   geeks

In [6]:
import numpy as np

In [7]:
aarr=np.array(['geeeks','for','geeks','is','a','protal','for','geeks'])

In [8]:
aarr

array(['geeeks', 'for', 'geeks', 'is', 'a', 'protal', 'for', 'geeks'],
      dtype='<U6')

In [9]:
pd.DataFrame(aarr)

        0
0  geeeks
1     for
2   geeks
3      is
4       a
5  protal
6     for
7   geeks

In [15]:
data= {'name':['jai','princi','gaurav','anuj'],'age':[27,24,22,32],'adress':['delhi','kanpur','allahabad','kannauj'],'qualification': ['msc','ma','mca','phd']}

In [16]:
df=pd.DataFrame(data)

In [17]:
df

     name  age     adress qualification
0     jai   27      delhi           msc
1  princi   24     kanpur            ma
2  gaurav   22  allahabad           mca
3    anuj   32    kannauj           phd

In [19]:
df[['age','qualification']]

   age qualification
0   27           msc
1   24            ma
2   22           mca
3   32           phd

In [20]:
data={'one':pd.Series([1,2,3,4]),'two':pd.Series([10,20,30,40]),'three':pd.Series([100,200,300,400]),'four':pd.Series([1000,2000,3000,4000])}

In [21]:
df=pd.DataFrame(data)

In [22]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [23]:
df.loc[1:2,'three':'four']

   three  four
1    200  2000
2    300  3000

In [24]:
df.iloc[1:-1,1:-1]

   two  three
1   20    200
2   30    300

In [25]:
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400

In [26]:
df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

In [27]:
df.loc[df['two']>20,['three','four']]

   three  four
2    300  3000
3    400  4000

In [28]:
l=[22,33,44,55]
df['five']=l

In [29]:
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

In [30]:
sr=pd.Series([111,222,333,444])

In [31]:
df['six']=sr

In [32]:
df

   one  two  three  four  five  six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

In [33]:
df['seven']=df['one']+10

In [34]:
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111     11
1    2   20    200  2000    33  222     12
2    3   30    300  3000    44  333     13
3    4   40    400  4000    55  444     14

In [37]:
del df['six']

In [38]:
df

   one  two  three  four  five  seven
0    1   10    100  1000    22     11
1    2   20    200  2000    33     12
2    3   30    300  3000    44     13
3    4   40    400  4000    55     14

In [39]:
df.pop('five')

0    22
1    33
2    44
3    55
Name: five, dtype: int64

In [40]:
df

   one  two  three  four  seven
0    1   10    100  1000     11
1    2   20    200  2000     12
2    3   30    300  3000     13
3    4   40    400  4000     14

In [41]:
df1=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])

In [42]:
df2=pd.DataFrame([[5,6],[7,8]],columns=['a','b'])

In [44]:
df3=df1.append(df2).reset_index(drop=True)

/var/folders/ph/d4p92xcn54g9k275395_7t_m0000gn/T/ipykernel_84818/2707303256.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3=df1.append(df2).reset_index(drop=True)

In [46]:
df3

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [51]:
data={
    'one':pd.Series([1,2,3,4]),'two':pd.Series([10,20,30,40]),'three':pd.Series([100,200,300,400]),'four':pd.Series([1000,2000,3000,4000])}

In [53]:
data

{'one': 0    1
 1    2
 2    3
 3    4
 dtype: int64,
 'two': 0    10
 1    20
 2    30
 3    40
 dtype: int64,
 'three': 0    100
 1    200
 2    300
 3    400
 dtype: int64,
 'four': 0    1000
 1    2000
 2    3000
 3    4000
 dtype: int64}

In [55]:
df=pd.DataFrame(data)

In [56]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [57]:
df.drop(['one','three'],axis=1,inplace=True)

In [58]:
df

   two  four
0   10  1000
1   20  2000
2   30  3000
3   40  4000

In [59]:
df.T

         0     1     2     3
two     10    20    30    40
four  1000  2000  3000  4000

In [60]:
df

   two  four
0   10  1000
1   20  2000
2   30  3000
3   40  4000

In [62]:
df=pd.read_csv('Football.csv')

In [63]:
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     660 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

In [65]:
df.isnull()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
656,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
657,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
658,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
659,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [66]:
df.isnull().sum()

Country                    0
League                     0
Club                       0
Player Names               0
Matches_Played             0
Substitution               0
Mins                       0
Goals                      0
xG                         0
xG Per Avg Match           0
Shots                      0
OnTarget                   0
Shots Per Avg Match        0
On Target Per Avg Match    0
Year                       0
dtype: int64

In [67]:
df.describe(percentiles=[.80])

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
80%,32.000000,6.000000,2915.800000,15.000000,14.076000,0.610000,90.000000,39.000000,3.600000,1.630000,2020.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [68]:
de=df.copy()

In [69]:
de.head(3)

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016